Repository: HotCakeX/Harden-Windows-Security
Catalog: Harden System Security/Strings/*/Resources.resw
Source language: en_us
Languages: ar, de_de, el_gr, es, fr_fr, he_il, hi_in, ml_in, pl_pl

# TLSSecurity_TLS_ForBattleNet
source: Only select this if you actually use the Battle.net Game client.
ar: حدّد هذا فقط إذا كنت تستخدم بالفعل عميل لعبة Battle.net.
de_de: Wählen Sie dies nur aus, wenn Sie den Battle.net-Spielclient tatsächlich verwenden.
el_gr: Επιλέξτε το μόνο αν χρησιμοποιείτε πράγματι τον πελάτη παιχνιδιού Battle.net.
es: Selecciona esto solo si realmente usas el cliente de juego de Battle.net.
fr_fr: Sélectionnez ceci uniquement si vous utilisez réellement le client de jeu Battle.net.
he_il: בחר רק אם אתה משתמש בפועל בלקוח המשחק Battle.net.
hi_in: इसे तभी चुनें जब आप वास्तव में Battle.net गेम क्लाइंट का उपयोग करते हों।
ml_in: നിങ്ങൾ യഥാർത്ഥത്തിൽ Battle.net ഗെയിം ക്ലയന്റ് ഉപയോഗിക്കുന്നുവെങ്കിൽ മാത്രമേ ഇത് തിരഞ്ഞെടുക്കുക.
pl_pl: Wybierz tę opcję tylko jeśli faktycznie używasz klienta gry Battle.net.

# MiscellaneousConfigurations_MiscellaneousConfigurations_ReducedTelemetry
source: Some OS features will become unavailable.
ar: ستصبح بعض ميزات نظام التشغيل غير متاحة.
de_de: Einige Betriebssystemfunktionen werden nicht mehr verfügbar sein.
el_gr: Ορισμένες λειτουργίες του λειτουργικού συστήματος θα καταστούν μη διαθέσιμες.
es: Algunas funciones del sistema operativo dejarán de estar disponibles.
fr_fr: Certaines fonctionnalités du système d'exploitation deviendront indisponibles.
he_il: חלק מתכונות מערכת ההפעלה יהפכו לבלתי זמינות.
hi_in: OS की कुछ विशेषताएँ उपलब्ध नहीं रहेंगी।
ml_in: ചില OS സവിശേഷതകൾ ലഭ്യമാകില്ല.
pl_pl: Niektóre funkcje systemu operacyjnego staną się niedostępne.

# OptimizeMemoryButton.Content
source: Optimize Memory
ar: تحسين الذاكرة
de_de: Speicher optimieren
el_gr: Βελτιστοποίηση μνήμης
es: Optimizar memoria
fr_fr: Optimiser la mémoire
he_il: מטב זיכרון
hi_in: मेमोरी अनुकूलित करें
ml_in: മെമ്മറി ഓപ്റ്റിമൈസ് ചെയ്യുക
pl_pl: Optymalizuj pamięć

# OptimizeMemoryButton.ToolTipService.ToolTip
source: Attempt to reduce memory usage by collecting and compacting unused managed memory (including large objects). The OS may release RAM gradually, so changes might not show immediately. Check Logs after pressing this button for more details.
ar: محاولة تقليل استهلاك الذاكرة عبر جمع الذاكرة المُدارة غير المستخدمة وضغطها (بما في ذلك الكائنات الكبيرة). قد يقوم نظام التشغيل بإطلاق ذاكرة RAM تدريجياً، لذا قد لا تظهر التغييرات مباشرة. راجع السجلات بعد الضغط على هذا الزر لمزيد من التفاصيل.
de_de: Versucht, den Speicherverbrauch zu reduzieren, indem ungenutzter verwalteter Speicher (einschließlich großer Objekte) gesammelt und komprimiert wird. Das Betriebssystem gibt RAM möglicherweise schrittweise frei, sodass Änderungen nicht sofort sichtbar sind. Prüfen Sie nach dem Drücken dieser Schaltfläche die Protokolle für mehr Details.
el_gr: Προσπάθεια μείωσης της χρήσης μνήμης μέσω συλλογής και συμπίεσης μη χρησιμοποιούμενης διαχειριζόμενης μνήμης (συμπεριλαμβανομένων μεγάλων αντικειμένων). Το λειτουργικό σύστημα ενδέχεται να αποδεσμεύει τη RAM σταδιακά, οπότε οι αλλαγές ίσως να μην εμφανιστούν αμέσως. Ελέγξτε τα αρχεία καταγραφής μετά το πάτημα αυτού του κουμπιού για περισσότερες λεπτομέρειες.
es: Intento de reducir el uso de memoria recopilando y compactando memoria administrada no utilizada (incluidos objetos grandes). El sistema operativo puede liberar la RAM gradualmente, por lo que los cambios podrían no mostrarse de inmediato. Revisa los registros después de presionar este botón para más detalles.
fr_fr: Tenter de réduire l'utilisation de la mémoire en collectant et en compactant la mémoire gérée inutilisée (y compris les objets volumineux). Le système d'exploitation peut libérer la RAM progressivement, donc les changements peuvent ne pas apparaître immédiatement. Vérifiez les journaux après avoir appuyé sur ce bouton pour plus de détails.
he_il: נסה להפחית שימוש בזיכרון על ידי איסוף ודחיסת זיכרון מנוהל שאינו בשימוש (כולל אובייקטים גדולים). מערכת ההפעלה עשויה לשחרר RAM בהדרגה, לכן השינויים לא בהכרח יופיעו מיד. בדוק יומנים לאחר לחיצה על לחצן זה לפרטים נוספים.
hi_in: अप्रयुक्त प्रबंधित मेमोरी (बड़े ऑब्जेक्ट सहित) को एकत्रित और कॉम्पैक्ट करके मेमोरी उपयोग कम करने का प्रयास। OS RAM को धीरे-धीरे रिलीज़ कर सकता है, इसलिए परिवर्तन तुरंत दिखाई नहीं भी दें। इस बटन को दबाने के बाद अधिक विवरण के लिए लॉग्स देखें।
ml_in: ഉപയോഗത്തിലില്ലാത്ത മാനേജുചെയ്യുന്ന മെമ്മറി (വലുതായ ഒബ്ജക്റ്റുകൾ ഉൾപ്പെടെ) ശേഖരിച്ചു കമ്പാക്റ്റ് ചെയ്ത് മെമ്മറി ഉപയോഗം കുറയ്ക്കാനുള്ള ശ്രമം. ഓ.എസ്. RAM ക്രമേണ റിലീസ് ചെയ്യാൻ സാധ്യതയുണ്ട്, അതിനാൽ മാറ്റങ്ങൾ ഉടൻ പ്രകടമാകണമെന്നില്ല. കൂടുതൽ വിവരങ്ങൾക്ക് ഈ ബട്ടൺ അമർത്തിയതിന് ശേഷം ലോഗുകൾ പരിശോധിക്കുക.
pl_pl: Próba zmniejszenia użycia pamięci poprzez zebranie i skompaktowanie nieużywanej pamięci zarządzanej (w tym dużych obiektów). System operacyjny może zwalniać pamięć RAM stopniowo, dlatego zmiany mogą nie być widoczne od razu. Sprawdź dzienniki po naciśnięciu tego przycisku, aby uzyskać więcej szczegółów.

# OptimizeMemoryButton.AutomationProperties.HelpText
source: Attempt to reduce memory usage by collecting and compacting unused managed memory (including large objects). The OS may release RAM gradually, so changes might not show immediately. Check Logs after pressing this button for more details.
ar: محاولة تقليل استهلاك الذاكرة عبر جمع الذاكرة المُدارة غير المستخدمة وضغطها (بما في ذلك الكائنات الكبيرة). قد يقوم نظام التشغيل بإطلاق ذاكرة RAM تدريجياً، لذا قد لا تظهر التغييرات مباشرة. راجع السجلات بعد الضغط على هذا الزر لمزيد من التفاصيل.
de_de: Versucht, den Speicherverbrauch zu reduzieren, indem ungenutzter verwalteter Speicher (einschließlich großer Objekte) gesammelt und komprimiert wird. Das Betriebssystem gibt RAM möglicherweise schrittweise frei, sodass Änderungen nicht sofort sichtbar sind. Prüfen Sie nach dem Drücken dieser Schaltfläche die Protokolle für mehr Details.
el_gr: Προσπάθεια μείωσης της χρήσης μνήμης μέσω συλλογής και συμπίεσης μη χρησιμοποιούμενης διαχειριζόμενης μνήμης (συμπεριλαμβανομένων μεγάλων αντικειμένων). Το λειτουργικό σύστημα ενδέχεται να αποδεσμεύει τη RAM σταδιακά, οπότε οι αλλαγές ίσως να μην εμφανιστούν αμέσως. Ελέγξτε τα αρχεία καταγραφής μετά το πάτημα αυτού του κουμπιού για περισσότερες λεπτομέρειες.
es: Intento de reducir el uso de memoria recopilando y compactando memoria administrada no utilizada (incluidos objetos grandes). El sistema operativo puede liberar la RAM gradualmente, por lo que los cambios podrían no mostrarse de inmediato. Revisa los registros después de presionar este botón para más detalles.
fr_fr: Tenter de réduire l'utilisation de la mémoire en collectant et en compactant la mémoire gérée inutilisée (y compris les objets volumineux). Le système d'exploitation peut libérer la RAM progressivement, donc les changements peuvent ne pas apparaître immédiatement. Vérifiez les journaux après avoir appuyé sur ce bouton pour plus de détails.
he_il: נסה להפחית שימוש בזיכרון על ידי איסוף ודחיסת זיכרון מנוהל שאינו בשימוש (כולל אובייקטים גדולים). מערכת ההפעלה עשויה לשחרר RAM בהדרגה, לכן השינויים לא בהכרח יופיעו מיד. בדוק יומנים לאחר לחיצה על לחצן זה לפרטים נוספים.
hi_in: अप्रयुक्त प्रबंधित मेमोरी (बड़े ऑब्जेक्ट सहित) को एकत्रित और कॉम्पैक्ट करके मेमोरी उपयोग कम करने का प्रयास। OS RAM को धीरे-धीरे रिलीज़ कर सकता है, इसलिए परिवर्तन तुरंत दिखाई नहीं भी दें। इस बटन को दबाने के बाद अधिक विवरण के लिए लॉग्स देखें।
ml_in: ഉപയോഗത്തിലില്ലാത്ത മാനേജുചെയ്യുന്ന മെമ്മറി (വലുതായ ഒബ്ജക്റ്റുകൾ ഉൾപ്പെടെ) ശേഖരിച്ചു കമ്പാക്റ്റ് ചെയ്ത് മെമ്മറി ഉപയോഗം കുറയ്ക്കാനുള്ള ശ്രമം. ഓ.എസ്. RAM ക്രമേണ റിലീസ് ചെയ്യാൻ സാധ്യതയുണ്ട്, അതിനാൽ മാറ്റങ്ങൾ ഉടൻ പ്രകടമാകണമെന്നില്ല. കൂടുതൽ വിവരങ്ങൾക്ക് ഈ ബട്ടൺ അമർത്തിയതിന് ശേഷം ലോഗുകൾ പരിശോധിക്കുക.
pl_pl: Próba zmniejszenia użycia pamięci poprzez zebranie i skompaktowanie nieużywanej pamięci zarządzanej (w tym dużych obiektów). System operacyjny może zwalniać pamięć RAM stopniowo, dlatego zmiany mogą nie być widoczne od razu. Sprawdź dzienniki po naciśnięciu tego przycisku, aby uzyskać więcej szczegółów.

# SecurityBaselinesComboBox.ToolTipService.ToolTip
source: Select the Microsoft Security Baseline that you want to use.
ar: اختر خط الأساس للأمان من Microsoft الذي تريد استخدامه.
de_de: Wählen Sie die Microsoft-Sicherheitsbaseline aus, die Sie verwenden möchten.
el_gr: Επιλέξτε τη βασική γραμμή ασφαλείας της Microsoft που θέλετε να χρησιμοποιήσετε.
es: Selecciona la línea base de seguridad de Microsoft que deseas usar.
fr_fr: Sélectionnez la base de référence de sécurité Microsoft que vous souhaitez utiliser.
he_il: בחר את בסיס האבטחה של Microsoft שבו תרצה להשתמש.
hi_in: वह Microsoft सुरक्षा बेसलाइन चुनें जिसे आप उपयोग करना चाहते हैं.
ml_in: നിങ്ങൾ ഉപയോഗിക്കാൻ ആഗ്രഹിക്കുന്ന Microsoft സുരക്ഷാ ബേസ്ലൈൻ തിരഞ്ഞെടുക്കുക.
pl_pl: Wybierz bazową konfigurację zabezpieczeń firmy Microsoft, której chcesz użyć.

# SecurityBaselinesComboBox.AutomationProperties.HelpText
source: Select the Microsoft Security Baseline that you want to use.
ar: اختر خط الأساس للأمان من Microsoft الذي تريد استخدامه.
de_de: Wählen Sie die Microsoft-Sicherheitsbaseline aus, die Sie verwenden möchten.
el_gr: Επιλέξτε τη βασική γραμμή ασφαλείας της Microsoft που θέλετε να χρησιμοποιήσετε.
es: Selecciona la línea base de seguridad de Microsoft que deseas usar.
fr_fr: Sélectionnez la base de référence de sécurité Microsoft que vous souhaitez utiliser.
he_il: בחר את בסיס האבטחה של Microsoft שבו תרצה להשתמש.
hi_in: वह Microsoft सुरक्षा बेसलाइन चुनें जिसे आप उपयोग करना चाहते हैं.
ml_in: നിങ്ങൾ ഉപയോഗിക്കാൻ ആഗ്രഹിക്കുന്ന Microsoft സുരക്ഷാ ബേസ്ലൈൻ തിരഞ്ഞെടുക്കുക.
pl_pl: Wybierz bazową konfigurację zabezpieczeń firmy Microsoft, której chcesz użyć.

# RetrieveButton.Content
source: Retrieve
ar: استرداد
de_de: Abrufen
el_gr: Ανάκτηση
es: Obtener
fr_fr: Récupérer
he_il: קבל
hi_in: प्राप्त करें
ml_in: പുനഃപ്രാപിക്കുക
pl_pl: Pobierz

# CryptoAlgorithmsTab.Header
source: Algorithms
ar: الخوارزميات
de_de: Algorithmen
el_gr: Αλγόριθμοι
es: Algoritmos
fr_fr: Algorithmes
he_il: אלגוריתמים
hi_in: एल्गोरिदम
ml_in: ആൽഗൊരിതങ്ങൾ
pl_pl: Algorytmy

# CngCurvesTab.Header
source: CNG Curves
ar: منحنيات CNG
de_de: CNG-Kurven
el_gr: Καμπύλες CNG
es: Curvas CNG
fr_fr: Courbes CNG
he_il: עקומות CNG
hi_in: CNG वक्र
ml_in: CNG വക്രങ്ങൾ
pl_pl: Krzywe CNG

# SslProviderCurvesTab.Header
source: SSL Provider Curves
ar: منحنيات مزودي SSL
de_de: SSL-Anbieterkurven
el_gr: Καμπύλες παρόχων SSL
es: Curvas de proveedores SSL
fr_fr: Courbes du fournisseur SSL
he_il: עקומות ספק SSL
hi_in: SSL प्रदाता वक्र
ml_in: SSL പ്രൊവൈഡർ വക്രങ്ങൾ
pl_pl: Krzywe dostawców SSL

# TlsCipherSuitesTab.Header
source: TLS Cipher Suites
ar: مجموعات التشفير TLS
de_de: TLS-Chiffresuiten
el_gr: Σουίτες κρυπτογράφησης TLS
es: Conjuntos de cifrado TLS
fr_fr: Suites de chiffrement TLS
he_il: חבילות צופן TLS
hi_in: TLS सिफर सूट
ml_in: TLS സൈഫർ സ്യൂട്ടുകൾ
pl_pl: Zestawy szyfrów TLS

# RegisteredProvidersTab.Header
source: Registered Providers
ar: المزوّدون المسجلون
de_de: Registrierte Anbieter
el_gr: Καταχωρημένοι πάροχοι
es: Proveedores registrados
fr_fr: Fournisseurs enregistrés
he_il: ספקים רשומים
hi_in: पंजीकृत प्रदाता
ml_in: രജിസ്റ്റർ ചെയ്ത പ്രൊവൈഡർമാർ
pl_pl: Zarejestrowani dostawcy

# ConfiguredOnlyToggleSwitch.OnContent
source: Configured Only
ar: المكوّنة فقط
de_de: Nur konfiguriert
el_gr: Μόνο ρυθμισμένα
es: Solo configurados
fr_fr: Configuré uniquement
he_il: מוגדרים בלבד
hi_in: केवल कॉन्फ़िगर किए गए
ml_in: കോൺഫിഗർ ചെയ്തവ മാത്രം
pl_pl: Tylko skonfigurowane

# ConfiguredOnlyToggleSwitch.OffContent
source: All
ar: الكل
de_de: Alle
el_gr: Όλα
es: Todos
fr_fr: Tout
he_il: הכול
hi_in: सभी
ml_in: എല്ലാം
pl_pl: Wszystkie

# CA_NameColumnHeaderBtn.Content
source: Name
ar: الاسم
el_gr: Όνομα
es: Nombre
fr_fr: Nom
he_il: שם
hi_in: नाम
ml_in: പേര്
pl_pl: Nazwa

# CA_TypeColumnHeaderBtn.Content
source: Type
ar: النوع
de_de: Typ
el_gr: Τύπος
es: Tipo
he_il: סוג
hi_in: प्रकार
ml_in: തരം
pl_pl: Typ

# CA_FlagsColumnHeaderBtn.Content
source: Flags
ar: الأعلام
de_de: Kennzeichen
el_gr: Σημαίες
es: Indicadores
fr_fr: Drapeaux
he_il: דגלים
hi_in: फ्लैग्स
ml_in: ഫ്ലാഗുകൾ
pl_pl: Flagi

# CA_IsOpenableColumnHeaderBtn.Content
source: Openable
ar: قابل للفتح
de_de: Öffnbar
el_gr: Δυνατότητα ανοίγματος
es: Se puede abrir
fr_fr: Ouvrable
he_il: ניתן לפתיחה
hi_in: खोलने योग्य
ml_in: തുറക്കാവുന്നത്
pl_pl: Możliwość otwarcia

# CA_IsPQColumnHeaderBtn.Content
source: Post-Quantum
ar: ما بعد الكم
de_de: Post-Quanten
el_gr: Μετακβαντικό
es: Poscuántico
fr_fr: Post-Quantique
he_il: פוסט-קוונטי
hi_in: पोस्ट-क्वांटम
ml_in: പോസ്റ്റ്-ക്വാണ്ടം
pl_pl: Postkwantowe

# CA_KeyGenColumnHeaderBtn.Content
source: Key Generation
ar: إنشاء المفاتيح
de_de: Schlüsselerzeugung
el_gr: Δημιουργία κλειδιών
es: Generación de claves
fr_fr: Génération de clé
he_il: יצירת מפתחות
hi_in: कुंजी निर्माण
ml_in: കീ നിർമ്മാണം
pl_pl: Generowanie klucza

# CA_ParamSetsColumnHeaderBtn.Content
source: Parameter Sets
ar: مجموعات المعلمات
de_de: Parametersätze
el_gr: Σύνολα παραμέτρων
es: Conjuntos de parámetros
fr_fr: Jeux de paramètres
he_il: ערכות פרמטרים
hi_in: पैरामीटर सेट
ml_in: പാരാമീറ്റർ സെറ്റുകൾ
pl_pl: Zestawy parametrów

# CNG_NameColumnHeaderBtn.Content
source: Name
ar: الاسم
el_gr: Όνομα
es: Nombre
fr_fr: Nom
he_il: שם
hi_in: नाम
ml_in: പേര്
pl_pl: Nazwa

# CNG_LengthColumnHeaderBtn.Content
source: Public Key Bits
ar: بتّات المفتاح العام
de_de: Bits des öffentlichen Schlüssels
el_gr: Bits δημόσιου κλειδιού
es: Bits de clave pública
fr_fr: Bits de clé publique
he_il: סיביות מפתח ציבורי
hi_in: सार्वजनिक कुंजी बिट्स
ml_in: പബ്ലിക് കീ ബിറ്റുകൾ
pl_pl: Bity klucza publicznego

# SSL_NameColumnHeaderBtn.Content
source: Name
ar: الاسم
el_gr: Όνομα
es: Nombre
fr_fr: Nom
he_il: שם
hi_in: नाम
ml_in: പേര്
pl_pl: Nazwa

# SSL_LengthColumnHeaderBtn.Content
source: Public Key Bits
ar: بتّات المفتاح العام
de_de: Bits des öffentlichen Schlüssels
el_gr: Bits δημόσιου κλειδιού
es: Bits de clave pública
fr_fr: Bits de clé publique
he_il: סיביות מפתח ציבורי
hi_in: सार्वजनिक कुंजी बिट्स
ml_in: പബ്ലിക് കീ ബിറ്റുകൾ
pl_pl: Bity klucza publicznego

# SSL_TypeColumnHeaderBtn.Content
source: Curve Type
ar: نوع المنحنى
de_de: Kurventyp
el_gr: Τύπος καμπύλης
es: Tipo de curva
fr_fr: Type de courbe
he_il: סוג עקומה
hi_in: वक्र प्रकार
ml_in: വക്രത്തിന്റെ തരം
pl_pl: Typ krzywej

# SSL_FlagsColumnHeaderBtn.Content
source: Flags
ar: الأعلام
de_de: Kennzeichen
el_gr: Σημαίες
es: Indicadores
fr_fr: Drapeaux
he_il: דגלים
hi_in: फ्लैग्स
ml_in: ഫ്ലാഗുകൾ
pl_pl: Flagi

# TLS_NameColumnHeaderBtn.Content
source: Name
ar: الاسم
el_gr: Όνομα
es: Nombre
fr_fr: Nom
he_il: שם
hi_in: नाम
ml_in: പേര്
pl_pl: Nazwa

# TLS_CipherColumnHeaderBtn.Content
source: Cipher
ar: التشفير
de_de: Chiffre
el_gr: Κρυπτογράφηση
es: Cifrado
fr_fr: Chiffrement
he_il: צופן
hi_in: सिफर
ml_in: സൈഫർ
pl_pl: Szyfr

# TLS_CSColumnHeaderBtn.Content
source: Cipher Suite
ar: مجموعة التشفير
de_de: Chiffresuite
el_gr: Σουίτα κρυπτογράφησης
es: Conjunto de cifrado
fr_fr: Suite de chiffrement
he_il: חבילת צופן
hi_in: सिफर सूट
ml_in: സൈഫർ സ്യൂട്ട്
pl_pl: Zestaw szyfrów

# TLS_BaseCSColumnHeaderBtn.Content
source: Base Cipher Suite
ar: مجموعة التشفير الأساسية
de_de: Basis-Chiffresuite
el_gr: Βασική σουίτα κρυπτογράφησης
es: Conjunto de cifrado base
fr_fr: Suite de chiffrement de base
he_il: חבילת צופן בסיסית
hi_in: बेस सिफर सूट
ml_in: ബേസ് സൈഫർ സ്യൂട്ട്
pl_pl: Bazowy zestaw szyfrów

# TLS_HashColumnHeaderBtn.Content
source: Hash
ar: التجزئة
el_gr: Κατακερματισμός
fr_fr: Hachage
he_il: גיבוב
hi_in: हैश
ml_in: ഹാഷ്
pl_pl: Skrót

# TLS_ExchangeColumnHeaderBtn.Content
source: Exchange
ar: تبادل المفاتيح
de_de: Schlüsselaustausch
el_gr: Ανταλλαγή κλειδιών
es: Intercambio de claves
fr_fr: Échange
he_il: חילופי מפתחות
hi_in: कुंजी विनिमय
ml_in: കീ കൈമാറ്റം
pl_pl: Wymiana kluczy

# TLS_CertColumnHeaderBtn.Content
source: Certificate
ar: الشهادة
de_de: Zertifikat
el_gr: Πιστοποιητικό
es: Certificado
fr_fr: Certificat
he_il: תעודה
hi_in: प्रमाणपत्र
ml_in: സർട്ടിഫിക്കറ്റ്
pl_pl: Certyfikat

# TLS_CLenColumnHeaderBtn.Content
source: Cipher Len
ar: طول الشيفرة
de_de: Chiffre-Länge
el_gr: Μήκος κρυπτογράφησης
es: Longitud de cifrado
fr_fr: Long. Chiffrement
he_il: אורך צופן
hi_in: सिफर लंबाई
ml_in: സൈഫർ നീളം
pl_pl: Długość szyfru

# TLS_CBLenColumnHeaderBtn.Content
source: Block Len
ar: طول الكتلة
de_de: Blocklänge
el_gr: Μήκος μπλοκ
es: Longitud de bloque
fr_fr: Long. Bloc
he_il: אורך בלוק
hi_in: ब्लॉक लंबाई
ml_in: ബ്ലോക്ക് നീളം
pl_pl: Długość bloku

# TLS_HLenColumnHeaderBtn.Content
source: Hash Len
ar: طول التجزئة
de_de: Hash-Länge
el_gr: Μήκος κατακερματισμού
es: Longitud de hash
fr_fr: Long. Hachage
he_il: אורך גיבוב
hi_in: हैश लंबाई
ml_in: ഹാഷ് നീളം
pl_pl: Długość skrótu

# TLS_MinExColumnHeaderBtn.Content
source: Min Exch Len
ar: الطول الأدنى للتبادل
de_de: Min. Austauschlänge
el_gr: Ελάχιστο μήκος ανταλλαγής
es: Longitud mínima de intercambio
fr_fr: Long. Min Éch.
he_il: אורך חילוף מינימלי
hi_in: न्यूनतम विनिमय लंबाई
ml_in: കുറഞ്ഞ കൈമാറ്റ നീളം
pl_pl: Minimalna długość wymiany

# TLS_MaxExColumnHeaderBtn.Content
source: Max Exch Len
ar: الطول الأقصى للتبادل
de_de: Max. Austauschlänge
el_gr: Μέγιστο μήκος ανταλλαγής
es: Longitud máxima de intercambio
fr_fr: Long. Max Éch.
he_il: אורך חילוף מקסימלי
hi_in: अधिकतम विनिमय लंबाई
ml_in: പരമാവധി കൈമാറ്റ നീളം
pl_pl: Maksymalna długość wymiany

# TLS_KeyTypeColumnHeaderBtn.Content
source: Key Type
ar: نوع المفتاح
de_de: Schlüsseltyp
el_gr: Τύπος κλειδιού
es: Tipo de clave
fr_fr: Type de clé
he_il: סוג מפתח
hi_in: कुंजी प्रकार
ml_in: കീ തരം
pl_pl: Typ klucza

# REG_NameColumnHeaderBtn.Content
source: Name
ar: الاسم
el_gr: Όνομα
es: Nombre
fr_fr: Nom
he_il: שם
hi_in: नाम
ml_in: പേര്
pl_pl: Nazwa

# CBOMNavItem.Content
source: Cryptographic Bill of Materials
ar: كشف المكوّنات التشفيرية
de_de: Kryptografische Stückliste
el_gr: Κατάλογος κρυπτογραφικών στοιχείων
es: Lista de materiales criptográficos
fr_fr: Nomenclature cryptographique
he_il: רשימת חומרים קריפטוגרפית
hi_in: क्रिप्टोग्राफ़िक बिल ऑफ़ मैटेरियल्स
ml_in: ക്രിപ്റ്റോഗ്രാഫിക് ബിൽ ഓഫ് മെറ്റീരിയൽസ്
pl_pl: Kryptograficzny wykaz materiałów

# CBOMNavItem.ToolTipService.ToolTip
source: The Cryptographic Bill of Materials (CBOM) provides a system-level inventory of OS cryptography-algorithms, curves, cipher suites, and providers-capturing the platform's cryptographic posture.
ar: يكشف كشف المكوّنات التشفيرية (CBOM) عن جرد على مستوى النظام لتشفير نظام التشغيل - الخوارزميات، والمنحنيات، ومجموعات التشفير، والمزوّدين - بما يعكس الوضع التشفيري للمنصة.
de_de: Die Kryptografische Stückliste (CBOM) bietet eine Bestandsaufnahme der Krypto-Komponenten des Betriebssystems auf Systemebene – Algorithmen, Kurven, Chiffresuiten und Anbieter – und bildet damit die kryptografische Sicherheitslage der Plattform ab.
el_gr: Ο Κατάλογος Κρυπτογραφικών Στοιχείων (CBOM) παρέχει απογραφή σε επίπεδο συστήματος της κρυπτογραφίας του λειτουργικού συστήματος - αλγόριθμοι, καμπύλες, σουίτες κρυπτογράφησης και πάροχοι - αποτυπώνοντας τη κρυπτογραφική στάση της πλατφόρμας.
es: La lista de materiales criptográficos (CBOM) proporciona un inventario a nivel de sistema de la criptografía del sistema operativo -algoritmos, curvas, conjuntos de cifrado y proveedores- capturando la postura criptográfica de la plataforma.
fr_fr: La nomenclature cryptographique (CBOM) fournit un inventaire au niveau du système des algorithmes de cryptographie, des courbes, des suites de chiffrement et des fournisseurs du système d'exploitation, capturant ainsi la posture cryptographique de la plateforme.
he_il: רשימת החומרים הקריפטוגרפית (CBOM) מספקת מלאי ברמת המערכת של קריפטוגרפיית מערכת ההפעלה-אלגוריתמים, עקומות, חבילות צופן וספקים-ומשקפת את עמדת הקריפטוגרפיה של הפלטפורמה.
hi_in: क्रिप्टोग्राफ़िक बिल ऑफ़ मैटेरियल्स (CBOM) ऑपरेटिंग सिस्टम की क्रिप्टोग्राफ़ी - एल्गोरिदम, वक्र, सिफर सूट और प्रदाता - का सिस्टम-स्तरीय इन्वेंटरी प्रदान करता है, जिससे प्लेटफ़ॉर्म की क्रिप्टोग्राफ़िक मुद्रा परिलक्षित होती है.
ml_in: ക്രിപ്റ്റോഗ്രാഫിക് ബിൽ ഓഫ് മെറ്റീരിയൽസ് (CBOM) ഓ.എസ്. ക്രിപ്റ്റോഗ്രാഫിയുടെ സിസ്റ്റം-ലെവൽ ഇൻവെന്ററി - ആൽഗൊരിതങ്ങൾ, വക്രങ്ങൾ, സൈഫർ സ്യൂട്ടുകൾ, പ്രൊവൈഡർമാർ - നൽകുന്നു, പ്ലാറ്റ്‌ഫോമിന്റെ ക്രിപ്റ്റോഗ്രാഫിക് നിലപാട് രേഖപ്പെടുത്തുന്നു.
pl_pl: Kryptograficzny wykaz materiałów (CBOM) zapewnia inwentaryzację na poziomie systemu w zakresie kryptografii systemu operacyjnego - algorytmów, krzywych, zestawów szyfrów i dostawców - odwzorowując kryptograficzną postawę platformy.

# CBOMNavItem.AutomationProperties.HelpText
source: The Cryptographic Bill of Materials (CBOM) provides a system-level inventory of OS cryptography-algorithms, curves, cipher suites, and providers-capturing the platform's cryptographic posture.
ar: يكشف كشف المكوّنات التشفيرية (CBOM) عن جرد على مستوى النظام لتشفير نظام التشغيل - الخوارزميات، والمنحنيات، ومجموعات التشفير، والمزوّدين - بما يعكس الوضع التشفيري للمنصة.
de_de: Die Kryptografische Stückliste (CBOM) bietet eine Bestandsaufnahme der Krypto-Komponenten des Betriebssystems auf Systemebene – Algorithmen, Kurven, Chiffresuiten und Anbieter – und bildet damit die kryptografische Sicherheitslage der Plattform ab.
el_gr: Ο Κατάλογος Κρυπτογραφικών Στοιχείων (CBOM) παρέχει απογραφή σε επίπεδο συστήματος της κρυπτογραφίας του λειτουργικού συστήματος - αλγόριθμοι, καμπύλες, σουίτες κρυπτογράφησης και πάροχοι - αποτυπώνοντας τη κρυπτογραφική στάση της πλατφόρμας.
es: La lista de materiales criptográficos (CBOM) proporciona un inventario a nivel de sistema de la criptografía del sistema operativo -algoritmos, curvas, conjuntos de cifrado y proveedores- capturando la postura criptográfica de la plataforma.
fr_fr: La nomenclature cryptographique (CBOM) fournit un inventaire au niveau du système des algorithmes de cryptographie, des courbes, des suites de chiffrement et des fournisseurs du système d'exploitation, capturant ainsi la posture cryptographique de la plateforme.
he_il: רשימת החומרים הקריפטוגרפית (CBOM) מספקת מלאי ברמת המערכת של קריפטוגרפיית מערכת ההפעלה-אלגוריתמים, עקומות, חבילות צופן וספקים-ומשקפת את עמדת הקריפטוגרפיה של הפלטפורמה.
hi_in: क्रिप्टोग्राफ़िक बिल ऑफ़ मैटेरियल्स (CBOM) ऑपरेटिंग सिस्टम की क्रिप्टोग्राफ़ी - एल्गोरिदम, वक्र, सिफर सूट और प्रदाता - का सिस्टम-स्तरीय इन्वेंटरी प्रदान करता है, जिससे प्लेटफ़ॉर्म की क्रिप्टोग्राफ़िक मुद्रा परिलक्षित होती है.
ml_in: ക്രിപ്റ്റോഗ്രാഫിക് ബിൽ ഓഫ് മെറ്റീരിയൽസ് (CBOM) ഓ.എസ്. ക്രിപ്റ്റോഗ്രാഫിയുടെ സിസ്റ്റം-ലെവൽ ഇൻവെന്ററി - ആൽഗൊരിതങ്ങൾ, വക്രങ്ങൾ, സൈഫർ സ്യൂട്ടുകൾ, പ്രൊവൈഡർമാർ - നൽകുന്നു, പ്ലാറ്റ്‌ഫോമിന്റെ ക്രിപ്റ്റോഗ്രാഫിക് നിലപാട് രേഖപ്പെടുത്തുന്നു.
pl_pl: Kryptograficzny wykaz materiałów (CBOM) zapewnia inwentaryzację na poziomie systemu w zakresie kryptografii systemu operacyjnego - algorytmów, krzywych, zestawów szyfrów i dostawców - odwzorowując kryptograficzną postawę platformy.
